//------------------------------------------------------------------------------
// <автоматически создаваемое>
//     Этот код создан программой.
//
//     Изменения в этом файле могут привести к неправильной работе и будут потеряны в случае
//     повторной генерации кода. 
// </автоматически создаваемое>
//------------------------------------------------------------------------------

namespace Practica.Users
{


	public partial class Login
	{

		/// <summary>
		/// form1 элемент управления.
		/// </summary>
		/// <remarks>
		/// Автоматически созданное поле.
		/// Для изменения переместите объявление поля из файла конструктора в файл кода программной части.
		/// </remarks>
		protected global::System.Web.UI.HtmlControls.HtmlForm form1;

		/// <summary>
		/// lblError элемент управления.
		/// </summary>
		/// <remarks>
		/// Автоматически созданное поле.
		/// Для изменения переместите объявление поля из файла конструктора в файл кода программной части.
		/// </remarks>
		protected global::System.Web.UI.WebControls.Label lblError;

		/// <summary>
		/// img1 элемент управления.
		/// </summary>
		/// <remarks>
		/// Автоматически созданное поле.
		/// Для изменения переместите объявление поля из файла конструктора в файл кода программной части.
		/// </remarks>
		protected global::System.Web.UI.WebControls.Image img1;

		/// <summary>
		/// phone_email элемент управления.
		/// </summary>
		/// <remarks>
		/// Автоматически созданное поле.
		/// Для изменения переместите объявление поля из файла конструктора в файл кода программной части.
		/// </remarks>
		protected global::System.Web.UI.WebControls.TextBox phone_email;

		/// <summary>
		/// nickname элемент управления.
		/// </summary>
		/// <remarks>
		/// Автоматически созданное поле.
		/// Для изменения переместите объявление поля из файла конструктора в файл кода программной части.
		/// </remarks>
		protected global::System.Web.UI.WebControls.TextBox nickname;

		/// <summary>
		/// password элемент управления.
		/// </summary>
		/// <remarks>
		/// Автоматически созданное поле.
		/// Для изменения переместите объявление поля из файла конструктора в файл кода программной части.
		/// </remarks>
		protected global::System.Web.UI.WebControls.TextBox password;

		/// <summary>
		/// btnLogin элемент управления.
		/// </summary>
		/// <remarks>
		/// Автоматически созданное поле.
		/// Для изменения переместите объявление поля из файла конструктора в файл кода программной части.
		/// </remarks>
		protected global::System.Web.UI.WebControls.Button btnLogin;
	}
}
